<?php
	$num = 0;
	$num++;    // прибавляем к переменной a число 1
	echo $num; // выведет 1
?>
<?php
	$num = 0;
	$num--;    // отнимаем от переменной $num число 1
	echo $num; // выведет -1
?>

<?php
	$num = 10;
	$num++;
	$num++;
	$num--;
	echo $num;
?>
<p>Префіксний та постфіксний тип</p>
<p>Насправді операції інкременту та декременту можна записувати двома способами. У постфіксному вигляді операція записується після імені змінної, так: $a++, а префіксному вигляді - перед ім'ям змінної, ось так: ++$a.</p>
<p>У наступному прикладі перший echo виведе 0, оскільки спочатку спрацює виведення на екран, а потім змінна збільшиться</p>
<?php
	$num = 0;
	echo $num++; // выведет 0, тк переменная увеличится только после echo
	echo $num;   // выведет 1 - переменная поменялась
?>
<p>А тепер змінна спочатку збільшиться, а потім буде висновок на екран:</p>
<?php
	$num = 0;
	echo ++$num; // выведет 1 - переменная увеличилась сразу
?>

<?php
	$num1 = 0;
	$num2 = $num1++; // в переменную $num2 запишется 0
	echo $num2;      // выведет 0
	echo $num1;      // выведет 1 - переменная $num1 поменялась после записи в $num2
?>
<p>А тепер поміняємо постфіксну форму на префіксну</p>
<?php
	$num1 = 0;
	$num2 = ++$num1; // в переменную $num2 запишется 1
	echo $num2;      // выведет 1
?>
<p>Якщо наша операція виконується на окремому рядку, то різниці між префіксною та постфіксною формами немає:</p>
<?php
	$num = 0;
	++$num;
	$num++;
	echo $num; // выведет 2
?>