<p>Нехай у нас є якийсь рядок. Кожен символ у цьому рядку має свій порядковий номер: перший символ номер 0, другий символ номер 1, третій символ номер 2 і так далі.</p>
<p>У разі потреби можна отримати доступ до певного символу рядка за його номером. І тому пишеться ім'я змінний, після цього імені ставляться квадратні дужки й у цих дужках вказується номер символу.</p>
<?php
	$str = 'abcde';
	
	echo 'Виводить перший символ - "' . $str[0] . '" і інші: '; // выведет 'a'
	echo $str[1]; // выведет 'b'
	echo $str[2]; // выведет 'c'
?>

<?php
	$str = 'abcde';
	$str[0] = '+';
	
	echo $str; // выведет '+bcde'
?>
<p>Номер символу також може зберігатися у змінній:</p>
<?php
	$str = 'abcde';
	$num = 3; // номер символа в переменной
	
	echo $str[$num]; // выведет 'd'
?>
<p>Дано рядок 'abcde'. Звертаючись до окремих символів цього рядка, виведіть на екран символ 'a', символ 'c', символ 'e'.</p>
<?php 
	$str = 'abcde';
	echo $str[0];
	echo $str[2];
	echo $str[4];
?>
<p>Дано змінну з рядком 'abcde'. Звертаючись до окремих символів цього рядка, запишіть у нову змінну символи цього рядка у зворотному порядку, тобто 'edcba'.</p>
<?php 
	$string = 'abcde';
	echo $string[4];
	echo $string[3];
	echo $string[2];
	echo $string[1];
	echo $string[0];
?>
<p>Дана змінна $str з рядком 'abcde' і змінна $num із номером символу. Виведіть на екран символ, номер якого зберігається у змінній $num.</p>
<?php 
	$str = 'abcde';
	$num = 3;
	echo $str[$num];
?>
<p>Останній символ рядка</p>
<p>Давайте виведемо останній символ рядка. При цьому зробимо так, щоб наш скрипт сам визначав номер останнього символу незалежно від довжини рядка.</p>
<p>Як ви вже знаєте, довжину рядка можна знайти за допомогою функції strlen</p>
<?php
	$str = 'abcde';
	$last = strlen($str) - 1; // номер последнего символа
	echo $str[$last]; // выведет 'e'
?>
<p>Проміжну змінну $last можна і не вводити:</p>
<?php
	$str = 'abcde';
	echo $str[strlen($str) - 1]; // выведет 'e'
?>
<p>Дано рядок. Виведіть на екран останній символ.</p>
<?php 
	$str = '123456';
	$last = strlen($str) - 1;
	echo $str[$last];
?>
<p>Дано рядок. Виведіть на екран передостанній символ.</p>
<?php 
	$str = 'qwertyuio';
	$prelast = strlen($str) - 2;
	echo $str[$prelast];
?>
<p>Дано рядок. Виведіть на екран її передостанній символ.</p>
<?php 
	$str = 'qwertyuio';
	$prelast = strlen($str) - 3;
	echo $str[$prelast];
?>
<p>Цифри у рядку</p>
<?php
	$str = '12345';
	echo $str[0] + $str[1]; // выведет 3
?>
<p>Дано рядок '12345'. Знайдіть суму цифр цього рядка.</p>
<?php 
	$str = '12345';
	echo $str[0] + $str[1] + $str[2] + $str[3] + $str[4]
?>
<p>Числа</p>
<?php
	$num = 12345;
	$str = (string) $num;
	
	echo $str[0]; // выведет '1'
?>
<p>Дано число 12345. Знайдіть суму цифр цього числа.</p>
<?php 
	$num = 12345;
	$str = (string) $num;
	echo $str[0] + $str[1] + $str[2] + $str[3] + $str[4];
?>
<p>Дано число 12345. Знайдіть добуток цифр цього числа.</p>
<?php 
	$num = 12345;
	$str = (string) $num;
	echo $str[0] * $str[1] * $str[2] * $str[3] * $str[4];
?>
<p>Дано число 12345. Переставте цифри цього числа у зворотному порядку.</p>
<?php 
	$num = 12345;
	$str = (string) $num;
	echo $str[4] . $str[3] . $str[2] . $str[1] . $str[0];
?>