<p>Для зведення числа у ступінь також є спеціальний оператор **. Давайте за його допомогою зведемо число 10 у третій ступінь:</p>
<?php
	echo 10 ** 3; // выведет 1000
?>

<?php
	$a = 10;
	echo $a ** 3; // выведет 1000
?>

<?php
	$a = 10;
	$b = 3;
	echo $a ** $b; // выведет 1000
?>
<p>Зведіть число 2 до 10-го ступеня. Виведіть результат на екран.</p>
<?php 
	$a = 2;
	$b = 10;
	echo $a ** $b;
?>
<p>Операція зведення у ступінь має пріоритет перед множенням та діленням. У наступному прикладі спочатку виконається зведення у ступінь, а потім множення:</p>
<?php
	echo 2 * 2 ** 3;
?>

<?php
	$a = (3 * 2) ** 3;
	echo $a;
?>

<?php
	$a = 3 * 2 ** (3 + 1);
	echo $a;
?>

<?php
	$a = 3 * 2 ** 3 * 3;
	echo $a;
?>