<?php
	$test = '1';
	var_dump($test);
?>
<p>Примусово перетворемо на число</p>
<?php
	$test = (int) '1';
	var_dump($test); // выведет 1 - число
?>
<p>Можна скористатися командою перетворення прямо у виклику функції</p>
<?php
	$test = '1';
	var_dump((int) $test);
?>
<p>Перетворіть наступний рядок на число:</p>
<?php 
	$testik = '12345';
	var_dump((int) $testik);
?>
<p>Дробові числа</p>

<?php
	$test = '1.2';
	var_dump($test);
?>
<p>Для перетворення цього рядка на число слід скористатися командою float:</p>
<?php
	$test = (float) '1.2';
	var_dump($test); // выведет 1.2
?>
<p>Перетворіть наступний рядок на число:</p>
<?php
	$test = (float) '12.345';
	var_dump($test);
?>
<p>Перетворення дробу до цілого числа</p>
<p>Преобразуйте следующую строку в целое число:</p>
<?php
	$test = '12.345';
	var_dump((int) $test);
?>
<p>Можна також перетворити число до рядка:</p>
<?php
	$test = (string) 123;
	var_dump($test); // выведет '123'
?>
<p>Аналогічно працюватиме перетворення дробового числа:</p>
<?php
	$test = (string) 1.2;
	var_dump($test); // выведет '1.2'
?>
<p>Перетворіть наступне число на рядок:</p>
<?php
	$test = 12345;
	var_dump((string) $test);
?>
<?php
	$test = (string) 12.345;
	var_dump($test);
	echo strlen($test);
?>