<p>Математичні дії можна проводити зі змінними</p>
<p>Створіть змінну $a зі значенням 10 і змінну $b зі значенням 2. Виведіть на екран їхню суму, різницю, помноження та частку (результат поділу)</p>
<?php 
	$a = 10;
	$b = 2;

	$sum = $a + $b;
	$sub = $a - $b;
	$mul = $a * $b;
	$div = $a / $b;

	echo $sum . ' ';
	echo $sub . ' ';
	echo $mul . ' ';
	echo $div;
?>
<p>Створіть змінну $c зі значенням 10 та змінну $d зі значенням 5. Підсумуйте їх, а результат привласніть змінній $result. Виведіть на екран значення змінної $result.</p>
<?php 
	$c = 10;
	$d = 5;

	echo $result = $c + $d;
?>

<p>Создайте переменную $a со значением 1, переменную $b со значением 2 и переменную $c со значением 3. Выведите на экран их сумму.</p>
<?php 
	$a = 1;
	$b = 2;
	$c = 3;

	echo $result = $a + $b + $c;
?>

<p>Создайте переменную $a со значением 10 и переменную $b со значением 5. Отнимите от $a переменную $b и результат присвойте переменной $c. Затем создайте переменную $d, присвойте ей значение 7. Сложите переменные $c и $d, а результат запишите в переменную $result. Выведите на экран значение переменной $result.</p>

<?php 
	$a = 10;
	$b = 5;
	$c = $a - $b;
	$d = 7;
	$result = $c + $d;

	echo $result;
?>
