<p>Основним поняттям будь-якої мови програмування є змінна. Змінна являє собою контейнер, в якому ми можемо зберігати будь-які дані, наприклад рядки або числа.</p>

<p>Кожна змінна повинна мати ім'я, яке може складатися з латинських букв, чисел та знаків підкреслення. При цьому в PHP перед змінною обов'язково має бути написаний знак долара $, а перший символ імені змінної не повинен бути цифрою.</p>

<p>Веведемо змінну $a:</p>
<?php
$a = 3;
echo $a;
?>
<p>Завдання 1:</p>
<p>Створіть змінну $num і надайте їй значення 123. Виведіть значення цієї змінної на екран за допомогою команди echo.</p>
<?php
	$num = 123;
	echo $num;
?>
<p>Перезапис змінніх</p>
<p>Створіть змінну $a. Запишіть значення 10, виведіть його на екран. Потім запишіть значення 20, виведіть його на екран.</p>
<?php
	$a = 10;
	echo $a;

	echo(' заміна змінної на ');

	$a = 20;
	echo $a;
?>