<p>	$arr = ['a', 'b', 'c'];</p>
<?php
	$arr = ['a', 'b', 'c'];
	
	$arr[0] = '!';
	var_dump($arr); // выведет ['!', 'b', 'c']
?>
<p>Измените значение каждого из элементов этого массива.</p>
<?php
	$arr = ['a' => 1, 'b' => 2, 'c' => 3];
	$arr = ['aa' => 11, 'bb' => 22, 'cc' => 33];

	var_dump($arr);
?>
<p>Перезапис елементів</p>
<p>Можна також прочитувати поточне значення елемента, виконувати з ним якісь операції та записувати змінене значення назад до цього елемента:</p>
<?php
	$arr = ['a', 'b', 'c'];
	
	$arr[0] = $arr[0] . '!';
	$arr[1] = $arr[1] . '!';
	$arr[2] = $arr[2] . '!';
	
	var_dump($arr); // выведет ['a!', 'b!', 'c!']
?>

<?php
	$arr = ['a', 'b', 'c'];
	
	$arr[0] .= '!';
	$arr[1] .= '!';
	$arr[2] .= '!';
	
	var_dump($arr); // выведет ['a!', 'b!', 'c!']
?>
<p>Прибавьте к каждому элементу массива число 3. Выведите на экран измененный массив.</p>
<?php
	$arr = ['a' => 1, 'b' => 2, 'c' => 3];

	$arr['a'] += 3;
	$arr['b'] += 3;
	$arr['c'] += 3;

	var_dump($arr);
?>
<p>Инкремент и декремент</p>
<?php
	$arr = [1, 2, 3, 4];
	
	$arr[0]++;
	++$arr[1];
	$arr[2]--;
	--$arr[3];
	
	var_dump($arr); // выведет [2, 3, 2, 3]
?>
<p></p>
<?php
	$arr = ['a' => 1, 'b' => 2, 'c' => 3];
	
	$arr['a']++;
	$arr['a']++;
	$arr['b']--;
	$arr['c']--;
	$arr['c']--;
	
	var_dump($arr);
?>